<a href="https://colab.research.google.com/github/ashishkumar30/Machine-Learning/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
s = pd.Series([1,2,3,4]) #series is homogenous

In [0]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [0]:
import numpy as np

In [0]:
np.array([1,2,3,4])

array([1, 2, 3, 4])

In [0]:
[1,2,3,4]

[1, 2, 3, 4]

In [0]:
s[0] #pandas series and dataframe are mutable

1

In [0]:
s[0] = 99

In [0]:
s

0    99
1     2
2     3
3     4
dtype: int64

In [0]:
data = {"Name":["Shubham","Rajat","Ashish","Anoop","Aman"],"Age":[21,23,29,23,24]}

In [0]:
data

{'Age': [21, 23, 29, 23, 24],
 'Name': ['Shubham', 'Rajat', 'Ashish', 'Anoop', 'Aman']}

In [0]:
type(data)

dict

In [0]:
df = pd.DataFrame(data)
df

   Age     Name
0   21  Shubham
1   23    Rajat
2   29   Ashish
3   23    Anoop
4   24     Aman

In [0]:
pd.DataFrame(data,index=['a','b','c','d','e'])

   Age     Name
a   21  Shubham
b   23    Rajat
c   29   Ashish
d   23    Anoop
e   24     Aman

In [0]:
data

{'Age': [21, 23, 29, 23, 24],
 'Name': ['Shubham', 'Rajat', 'Ashish', 'Anoop', 'Aman']}

In [0]:
pd.DataFrame(data)

   Age     Name
0   21  Shubham
1   23    Rajat
2   29   Ashish
3   23    Anoop
4   24     Aman

In [0]:
data

{'Age': [21, 23, 29, 23, 24],
 'Name': ['Shubham', 'Rajat', 'Ashish', 'Anoop', 'Aman']}

In [0]:
data = {'Name': ['Amber', 'Devansh', 'Kabir', 'Sandeep', 'Shivam'],'Age': [20, 20, 20,20,21]}

In [0]:
df = pd.DataFrame(data)

In [0]:
df

   Age     Name
0   20    Amber
1   20  Devansh
2   20    Kabir
3   20  Sandeep
4   21   Shivam

In [0]:
df.T

            0      1       2      3     4
Age        21     23      29     23    24
Name  Shubham  Rajat  Ashish  Anoop  Aman

In [0]:
data = {'Name': ['Amber', 'Devansh', 'Kabir', 'Sandeep', 'Shivam'],'Age': [20, 20, 20,20,21],'Ratings':[5,5,4,-1,10]}

In [0]:
data

{'Age': [20, 20, 20, 20, 21],
 'Name': ['Amber', 'Devansh', 'Kabir', 'Sandeep', 'Shivam'],
 'Ratings': [5, 5, 4, -1, 10]}

In [0]:
df = pd.DataFrame(data)

In [0]:
df

   Age     Name  Ratings
0   20    Amber        5
1   20  Devansh        5
2   20    Kabir        4
3   20  Sandeep       -1
4   21   Shivam       10

In [0]:
df.axes #"0" is column, "1" is row

[RangeIndex(start=0, stop=5, step=1),
 Index(['Age', 'Name', 'Ratings'], dtype='object')]

In [0]:
df.axes[0]

RangeIndex(start=0, stop=5, step=1)

In [0]:
df["Ratings"]

0     5
1     5
2     4
3    -1
4    10
Name: Ratings, dtype: int64

In [0]:
df

   Age     Name  Ratings
0   20    Amber        5
1   20  Devansh        5
2   20    Kabir        4
3   20  Sandeep       -1
4   21   Shivam       10

In [0]:
type(df["Ratings"][1])

numpy.int64

In [0]:
df.dtypes

Age         int64
Name       object
Ratings     int64
dtype: object

In [0]:
df.shape

(5, 3)

In [0]:
df.values #dataframe to np.ndarray

array([[20, 'Amber', 5],
       [20, 'Devansh', 5],
       [20, 'Kabir', 4],
       [20, 'Sandeep', -1],
       [21, 'Shivam', 10]], dtype=object)

In [0]:
type(df.values)

numpy.ndarray

In [0]:
from sklearn.preprocessing import OneHotEncoder

In [0]:
df

   Age     Name  Ratings
0   20    Amber        5
1   20  Devansh        5
2   20    Kabir        4
3   20  Sandeep       -1
4   21   Shivam       10

In [0]:
df.head()

   Age     Name  Ratings
0   20    Amber        5
1   20  Devansh        5
2   20    Kabir        4
3   20  Sandeep       -1
4   21   Shivam       10

In [0]:
df.tail(2)

   Age     Name  Ratings
3   20  Sandeep       -1
4   21   Shivam       10

In [0]:
df

   Age     Name  Ratings
0   20    Amber        5
1   20  Devansh        5
2   20    Kabir        4
3   20  Sandeep       -1
4   21   Shivam       10

In [0]:
df.sum()

Age                                   101
Name       AmberDevanshKabirSandeepShivam
Ratings                                23
dtype: object

In [0]:
df.sum(axis=1)

0    25
1    25
2    24
3    19
4    31
dtype: int64

In [0]:
df.mean()

Age        20.2
Ratings     4.6
dtype: float64

In [0]:
df.std()

Age        0.447214
Ratings    3.911521
dtype: float64

In [0]:
df.describe()

             Age    Ratings
count   5.000000   5.000000
mean   20.200000   4.600000
std     0.447214   3.911521
min    20.000000  -1.000000
25%    20.000000   4.000000
50%    20.000000   5.000000
75%    20.000000   5.000000
max    21.000000  10.000000

In [0]:
df.describe(include='all') #try include=['object'] as well

              Age     Name    Rating
count    5.000000        5  5.000000
unique        NaN        5       NaN
top           NaN  Sandeep       NaN
freq          NaN        1       NaN
mean    20.200000      NaN  4.400000
std      0.447214      NaN  0.547723
min     20.000000      NaN  4.000000
25%     20.000000      NaN  4.000000
50%     20.000000      NaN  4.000000
75%     20.000000      NaN  5.000000
max     21.000000      NaN  5.000000

In [0]:
## PART--2 ##
s = pd.Series()

In [0]:
s

Series([], dtype: float64)

In [0]:
import numpy as np
data = np.array([1,2,3.4])

In [0]:
data

array([1. , 2. , 3.4])

In [0]:
s = pd.Series(data)

In [0]:
s

0    1.0
1    2.0
2    3.4
dtype: float64

In [0]:
s = pd.Series(data,index=['a','b','c'])

In [0]:
s

a    1.0
b    2.0
c    3.4
dtype: float64

In [0]:
s = pd.Series({'a':1.0,'b':2.0,'c':3.4})

In [0]:
s

a    1.0
b    2.0
c    3.4
dtype: float64

In [0]:
s['a']

1.0

In [0]:
s[['a','b']]

a    1.0
b    2.0
dtype: float64

In [0]:
s

a    1.0
b    2.0
c    3.4
dtype: float64

In [0]:
df = pd.read_csv("nyc_weather.csv")

In [0]:
df.shape

(31, 11)

In [0]:
df["Temperature"].mean()

34.67741935483871

In [0]:
df = pd.DataFrame({
    'A':pd.date_range(start = '2016-01-01',periods=20,freq='D'),
    'x':np.linspace(0,stop=19,num=20),
    'y':np.random.rand(20),
    'C':np.random.choice(['Low','Medium','High'],20).tolist(),
    'D':np.random.normal(100,10,size=(20)).tolist()
})

In [0]:
df

            A       C           D     x         y
0  2016-01-01     Low   96.212289   0.0  0.609260
1  2016-01-02    High   97.228445   1.0  0.792758
2  2016-01-03    High  109.387198   2.0  0.746927
3  2016-01-04  Medium  111.009427   3.0  0.917218
4  2016-01-05     Low  114.632199   4.0  0.878733
5  2016-01-06     Low  115.618193   5.0  0.421407
6  2016-01-07    High  106.425756   6.0  0.889221
7  2016-01-08  Medium  104.009525   7.0  0.037013
8  2016-01-09     Low  101.497003   8.0  0.953089
9  2016-01-10    High   89.176166   9.0  0.930886
10 2016-01-11  Medium  114.240272  10.0  0.434141
11 2016-01-12     Low   89.796555  11.0  0.670283
12 2016-01-13    High   82.753491  12.0  0.362973
13 2016-01-14  Medium  104.841435  13.0  0.208508
14 2016-01-15     Low   97.607770  14.0  0.260504
15 2016-01-16    High   90.388927  15.0  0.831967
16 2016-01-17  Medium   98.823399  16.0  0.986364
17 2016-01-18  Medium  105.100915  17.0  0.280450
18 2016-01-19     Low   97.929810  18.0  0.159682
19 2016-01-20     Low   76.750064  19.0  0.617250

In [0]:
df.reindex(index=[0,2,5],columns=['A','C','B']) #go to the documentation

           A     C   B
0 2016-01-01   Low NaN
2 2016-01-03  High NaN
5 2016-01-06   Low NaN

In [0]:
df1 = pd.DataFrame(np.random.randn(10,3),columns = ['col1','col2','col3'])

In [0]:
df2 = pd.DataFrame(np.random.randn(7,3),columns = ['col1','col2','col3'])

In [0]:
df1

       col1      col2      col3
0 -2.049816  0.819844  0.036210
1  1.424880  1.110688 -0.316423
2 -0.494110  1.795599  0.282826
3  0.915621 -0.565394  1.725845
4  1.121395 -2.157991  0.451283
5 -0.114940  0.490735 -0.027185
6 -2.699176  0.165965 -0.557309
7  0.467773  0.006137  0.003803
8  0.148889  1.051072 -0.107261
9  2.667665  0.035765  0.940652

In [0]:
df2

       col1      col2      col3
0 -0.505128 -0.808655  1.851476
1  1.423340 -0.634340 -1.394253
2  0.717426 -0.131643  0.866064
3  1.152641 -0.438720  0.660083
4  0.577376  0.939280  0.128747
5  1.089417  0.197512  0.096892
6 -2.153695 -2.335085 -0.939614

In [0]:
df1.reindex_like(df2)

       col1      col2      col3
0 -2.049816  0.819844  0.036210
1  1.424880  1.110688 -0.316423
2 -0.494110  1.795599  0.282826
3  0.915621 -0.565394  1.725845
4  1.121395 -2.157991  0.451283
5 -0.114940  0.490735 -0.027185
6 -2.699176  0.165965 -0.557309

In [0]:
df = pd.DataFrame(np.random.randn(5,3),index=['a','c','e','f','h'],columns=['one','two','three'])

In [0]:
df

        one       two     three
a  0.758943  0.858691 -0.097424
c  0.110367  0.038584 -2.376095
e -1.275647 -0.188710  1.466802
f  1.051748  1.598560 -0.527903
h  0.839504 -1.813798 -0.912424

In [0]:
df = df.reindex(['a','b','c','d','e','f','g','h'])

In [0]:
df

        one       two     three
a -0.456385 -0.481244 -0.198935
b       NaN       NaN       NaN
c -0.984339  0.356962 -1.838995
d       NaN       NaN       NaN
e -0.207289  1.633456 -0.060057
f -0.923019  0.028670  0.172352
g       NaN       NaN       NaN
h -0.182309  0.338274 -0.837249

In [0]:
df['one'].notnull() #try .isnull() as well

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [0]:
df['one'].sum()

-2.753341223632415

In [0]:
df.fillna(6)

        one       two     three
a  0.758943  0.858691 -0.097424
b  6.000000  6.000000  6.000000
c  0.110367  0.038584 -2.376095
d  6.000000  6.000000  6.000000
e -1.275647 -0.188710  1.466802
f  1.051748  1.598560 -0.527903
g  6.000000  6.000000  6.000000
h  0.839504 -1.813798 -0.912424

In [0]:
df.dropna()

        one       two     three
a -0.456385 -0.481244 -0.198935
c -0.984339  0.356962 -1.838995
e -0.207289  1.633456 -0.060057
f -0.923019  0.028670  0.172352
h -0.182309  0.338274 -0.837249

In [0]:
df

        one       two     three
a -0.456385 -0.481244 -0.198935
b       NaN       NaN       NaN
c -0.984339  0.356962 -1.838995
d       NaN       NaN       NaN
e -0.207289  1.633456 -0.060057
f -0.923019  0.028670  0.172352
g       NaN       NaN       NaN
h -0.182309  0.338274 -0.837249

In [0]:
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [0]:
df = pd.read_csv('weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [0]:
g = df.groupby('city')
print(g)

<pandas.core.groupby.DataFrameGroupBy object at 0x00000178BF37DD68>

In [0]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [0]:
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [0]:
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [0]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [0]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [0]:
import pandas as pd

In [0]:
df = pd.read_csv("nyc_weather.csv")

In [0]:
df.head(10)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109

In [0]:
df[['Temperature','Humidity']].isnull()

    Temperature  Humidity
0         False     False
1         False     False
2         False     False
3         False     False
4         False     False
5         False     False
6         False     False
7         False     False
8         False     False
9         False     False
10        False     False
11        False     False
12        False     False
13        False     False
14        False     False
15        False     False
16        False     False
17        False     False
18        False     False
19        False     False
20        False     False
21        False     False
22        False     False
23        False     False
24        False     False
25        False     False
26        False     False
27        False     False
28        False     False
29        False     False
30        False     False

In [0]:
df.iloc[0:11,0:6]

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy

In [0]:
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [0]:
for index,rows in df.iterrows():
    print(index)
    print(rows['temperature'])

0
32
1
36
2
28
3
33
4
90
5
85
6
87
7
92
8
45
9
50
10
54
11
42